In [37]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
data = pd.read_csv("messy_expense_dataset.csv")

In [3]:
df = pd.DataFrame(data)

In [4]:
df.head()

          Date  Category    Amount Payment_Mode
0   2025/02/19  Shopping  41201.81         Cash
1  Jan 07 2024  Shopping  43039.96         cash
2  Jun 03 2024       NaN  21515.17          Upi
3  Jun 03 2024    Health  21515.17          Upi
4     31-03-24    Dining  23419.00          NaN

In [5]:
df.shape

(1582, 4)

In [6]:
columns = list(df.columns)
print(columns)

['Date', 'Category', 'Amount', 'Payment_Mode']

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1582 entries, 0 to 1581
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          1582 non-null   object
 1   Category      1430 non-null   object
 2   Amount        1582 non-null   float64
 3   Payment_Mode  1435 non-null   object
dtypes: float64(1), object(3)
memory usage: 49.6+ KB

In [8]:
# df[list(df.columns[df.isna().any()])].isna().sum()
df.isna().sum()

Date              0
Category        152
Amount            0
Payment_Mode    147
dtype: int64

In [9]:
df.duplicated().any()

np.True_

In [10]:
df.duplicated().sum()

np.int64(73)

In [11]:
# get the duplicated data
df[df.duplicated()]

             Date       Category    Amount Payment_Mode
47       19-04-24  Subscriptions  23215.93         Cash
54     2024-01-19      Groceries  29135.09         Cash
69       13-01-24  Entertainment  35184.52  Credit Card
79    May 20 2024         Dining  31004.91   Debit Card
120    2024/05/07  Entertainment  33846.80          upi
...           ...            ...       ...          ...
1486   2025-02-20            NaN  32400.50         cash
1491     14-01-25         Health   2383.66  Credit Card
1513  Jul 04 2024   entertaiment  30479.32         cash
1520   2024-01-03      Utilities  33226.19         Cash
1580   2024-06-13       Shopping    172.58         cash

[73 rows x 4 columns]

In [12]:
df.drop_duplicates(inplace=True)

In [13]:
df.duplicated().any()

np.False_

In [14]:
df.isna().sum()

Date              0
Category        144
Amount            0
Payment_Mode    140
dtype: int64

Even after the removal of duplicated data we still have null values

In [15]:
dates = df["Date"]

In [16]:
print(dates.head())
print(dates.tail())

0     2025/02/19
1    Jan 07 2024
2    Jun 03 2024
3    Jun 03 2024
4       31-03-24
Name: Date, dtype: object
1576       31-01-25
1577    Jan 22 2024
1578     2024-12-15
1579     2024-06-13
1581     2024/08/09
Name: Date, dtype: object

In [17]:
# Convert the Date column into proper datetime format.

# Any rows that fail conversion → remove them.

# Sort data by Date.

In [18]:
# optimized form of code: 
df["Date"] = pd.to_datetime(df["Date"], dayfirst=True, errors="coerce")
df = df.dropna(subset=["Date"])

C:\Users\dipak\AppData\Local\Temp\ipykernel_21192\870472357.py:2: UserWarning: Parsing dates in %Y/%m/%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df["Date"] = pd.to_datetime(df["Date"], dayfirst=True, errors="coerce")

In [19]:
df.sort_values(by="Date", ascending=True, inplace=True)

In [20]:
print(df.head(3))
print(df.tail(3))

           Date       Category    Amount   Payment_Mode
382  2024-01-02  Entertainment   9496.55  Bank Transfer
1131 2024-01-03           Rent  44615.69            UPI
403  2024-01-04  Entertainment  40773.26     Debit Card
           Date      Category    Amount Payment_Mode
1051 2025-03-24     Transport  33402.19          upi
729  2025-03-25     Groceries  65379.79   Debit Card
23   2025-03-26  entertaiment      0.00  Credit Card

In [21]:
# Convert everything to lowercase.

# Strip spaces.

# Replace spelling mistakes with correct names.

# Remove rows where Category is missing or blank.

In [22]:
df["Category"] = df["Category"].astype(str).str.lower()

# df = df.drop()

In [23]:
df["Category"] = df["Category"].str.strip()

In [24]:
df.head()

           Date       Category    Amount   Payment_Mode
382  2024-01-02  entertainment   9496.55  Bank Transfer
1131 2024-01-03           rent  44615.69            UPI
403  2024-01-04  entertainment  40773.26     Debit Card
1350 2024-01-05   entertaiment  26641.36           UPI
339  2024-01-06      utilities  31115.46           UPI

In [25]:
# for spelling corrections: 
df["Category"].unique()

array(['entertainment', 'rent', 'entertaiment', 'utilities', 'transport',
       'dining', 'health', 'shopping', 'groceries', 'utilties', 'nan',
       'fuel', 'groccery', 'subscriptions'], dtype=object)

In [26]:
# build a incorrect:correct dict set: 
spellings = {"entertaiment":"entertainment",
             "utilties":"utilities",
             "nan":None,
             "groccery":"groceries"}

In [27]:
df["Category"] = df["Category"].replace(spellings)

In [28]:
df["Category"].isna().sum()

np.int64(30)

In [29]:
df = df.dropna(subset=["Category"]).reset_index(drop=True)

In [30]:
df["Category"].isna().sum()

np.int64(0)

In [ ]:
# # Payment Mode Normalization
# Convert to lowercase.

# Strip spaces.

# Replace blanks with "unknown".

# # Group similar names properly.

In [35]:
df["Payment_Mode"] = df["Payment_Mode"].str.lower()

In [33]:
df.head()

        Date       Category    Amount   Payment_Mode
0 2024-01-02  entertainment   9496.55  bank transfer
1 2024-01-03           rent  44615.69            upi
2 2024-01-04  entertainment  40773.26     debit card
3 2024-01-05  entertainment  26641.36           upi
4 2024-01-06      utilities  31115.46           upi

In [36]:
df["Payment_Mode"] = df["Payment_Mode"].str.strip()

In [39]:
df["Payment_Mode"].isna().sum()

np.int64(28)

In [42]:

df["Payment_Mode"].replace(np.nan,"unknown", inplace=True)

In [49]:
payment_mode_grouped = df.groupby("Payment_Mode")
print(list(payment_mode_grouped))

[('bank transfer',           Date       Category    Amount   Payment_Mode
0   2024-01-02  entertainment   9496.55  bank transfer
11  2024-01-17      utilities  56188.26  bank transfer
25  2024-02-01      groceries  53750.21  bank transfer
33  2024-02-06           fuel  64486.63  bank transfer
40  2024-02-18      groceries   4197.00  bank transfer
41  2024-02-19       shopping  11723.38  bank transfer
47  2024-02-29      utilities  50168.52  bank transfer
58  2024-03-08           rent  71077.93  bank transfer
61  2024-03-10      groceries  21654.74  bank transfer
68  2024-03-14           fuel  50949.70  bank transfer
73  2024-03-23         health  23696.81  bank transfer
77  2024-03-27  subscriptions  51654.36  bank transfer
79  2024-03-28           fuel  80691.32  bank transfer
80  2024-03-29      utilities  15984.90  bank transfer
91  2024-04-20         dining   2696.79  bank transfer
96  2024-04-25           rent  30269.61  bank transfer
105 2024-05-05      groceries  43956.22  bank transfer
111 2024-05-11      groceries  45867.39  bank transfer
114 2024-05-12      transport   8045.60  bank transfer
122 2024-05-25       shopping  34547.47  bank transfer
123 2024-05-26      transport  56837.41  bank transfer
145 2024-06-29  entertainment  49219.68  bank transfer
164 2024-07-22      utilities  59174.59  bank transfer
167 2024-07-24      groceries  68772.44  bank transfer
171 2024-07-31         dining  56553.35  bank transfer
176 2024-08-06      groceries  72931.80  bank transfer
181 2024-08-12           fuel  55175.22  bank transfer
199 2024-09-01  entertainment  43926.01  bank transfer
200 2024-09-01  subscriptions  67811.60  bank transfer
208 2024-09-18  subscriptions  67068.07  bank transfer
216 2024-09-25      utilities  83339.56  bank transfer
226 2024-10-10           rent  83459.92  bank transfer
246 2024-11-11         health  57051.93  bank transfer
254 2024-11-22      utilities  11932.33  bank transfer
266 2024-12-04      transport  81626.83  bank transfer
274 2024-12-21       shopping  63535.72  bank transfer
276 2024-12-23  subscriptions  45682.30  bank transfer
289 2025-01-04           fuel  31695.14  bank transfer
292 2025-01-08       shopping  80007.63  bank transfer
294 2025-01-09         health  81147.97  bank transfer
296 2025-01-11      utilities  59484.68  bank transfer
298 2025-01-12      groceries  14698.96  bank transfer
301 2025-01-15      utilities  84791.86  bank transfer
307 2025-01-23  subscriptions  42111.02  bank transfer
324 2025-02-10      transport      0.00  bank transfer
325 2025-02-11         health  75484.36  bank transfer
337 2025-03-02      groceries  31871.29  bank transfer
338 2025-03-04      transport  34163.05  bank transfer
349 2025-03-14      utilities  13994.42  bank transfer
351 2025-03-16         dining  10764.97  bank transfer), ('cash',           Date   Category    Amount Payment_Mode
6   2024-01-10  transport  60835.25         cash
18  2024-01-24   shopping  71886.98         cash
21  2024-01-26   shopping  50742.92         cash
22  2024-01-29       fuel  84153.93         cash
27  2024-02-02       fuel  82685.65         cash
..         ...        ...       ...          ...
332 2025-02-19   shopping  41201.81         cash
340 2025-03-05     dining  83308.08         cash
342 2025-03-08  transport  21398.89         cash
357 2025-03-21       fuel      0.00         cash
359 2025-03-22   shopping  35142.61         cash

[69 rows x 4 columns]), ('credit card',           Date       Category    Amount Payment_Mode
12  2024-01-18      groceries  39402.96  credit card
17  2024-01-23      groceries  81095.27  credit card
19  2024-01-25  entertainment      0.00  credit card
34  2024-02-09      transport   9213.15  credit card
49  2024-03-01           rent  24305.77  credit card
67  2024-03-14  entertainment   -137.81  credit card
74  2024-03-24           rent  50834.84  credit card
78  2024-03-27       shopping  61868.99  credit card
85  2024-04-09       shopping  55104.51  credit card
100 2024-04-30      utilities  10753.21  credit card
121 2024-05-25  subscriptions  45474.72  credit card
147 2024-06-30       shopping  36230.96  credit card
148 2024-07-04  entertainment      0.00  credit card
177 2024-08-08      utilities      0.00  credit card
180 2024-08-12      groceries  83074.94  credit card
195 2024-08-28         health  84098.46  credit card
196 2024-08-28      utilities      0.00  credit card
202 2024-09-05  entertainment  35249.17  credit card
232 2024-10-19      groceries  28757.47  credit card
244 2024-11-06  entertainment  31929.34  credit card
249 2024-11-13         dining   9251.28  credit card
259 2024-11-29  entertainment  33859.83  credit card
290 2025-01-06  entertainment  30926.68  credit card
303 2025-01-17           fuel  80153.37  credit card
315 2025-01-31         health  42765.21  credit card
330 2025-02-15      utilities  32158.23  credit card
334 2025-02-27           fuel  26834.50  credit card
335 2025-02-28  subscriptions  67592.60  credit card
341 2025-03-07           rent  39574.51  credit card
343 2025-03-08      utilities  53771.89  credit card
352 2025-03-16           rent  44486.71  credit card
354 2025-03-18       shopping  76088.36  credit card
362 2025-03-26  entertainment      0.00  credit card), ('debit card',           Date       Category    Amount Payment_Mode
2   2024-01-04  entertainment  40773.26   debit card
5   2024-01-07      utilities  43082.67   debit card
10  2024-01-16      groceries   9584.72   debit card
15  2024-01-19         health  24794.13   debit card
26  2024-02-02           fuel  36569.13   debit card
28  2024-02-02      transport      0.00   debit card
43  2024-02-22  entertainment  76932.13   debit card
57  2024-03-05       shopping  17234.25   debit card
64  2024-03-12  entertainment  17196.95   debit card
92  2024-04-21         dining  68660.77   debit card
119 2024-05-22      groceries  17139.75   debit card
125 2024-05-27           rent  70337.61   debit card
129 2024-06-05       shopping  10530.52   debit card
138 2024-06-15  entertainment  23491.22   debit card
143 2024-06-19  entertainment  45259.89   debit card
157 2024-07-15  subscriptions  68333.93   debit card
158 2024-07-15  entertainment  68413.25   debit card
165 2024-07-23       shopping  77058.66   debit card
186 2024-08-14  entertainment  77100.19   debit card
207 2024-09-18           fuel   2542.16   debit card
211 2024-09-20           rent    257.72   debit card
228 2024-10-12      transport  64019.48   debit card
239 2024-10-29         dining  35313.77   debit card
255 2024-11-22           fuel   3631.90   debit card
256 2024-11-23         health  14945.53   debit card
261 2024-11-30         health  11970.29   debit card
279 2024-12-26  entertainment  13698.79   debit card
281 2024-12-27  subscriptions  56412.84   debit card
282 2024-12-28      transport   1042.69   debit card
284 2024-12-29           rent  24956.48   debit card
295 2025-01-09           fuel  62908.43   debit card
309 2025-01-24      transport  45746.31   debit card
326 2025-02-12           fuel  83026.25   debit card
333 2025-02-22           rent  44133.27   debit card
361 2025-03-25      groceries  65379.79   debit card), ('unknown',           Date       Category    Amount Payment_Mode
9   2024-01-14       shopping  64209.24      unknown
30  2024-02-05       shopping  84097.11      unknown
45  2024-02-25  entertainment  82937.69      unknown
46  2024-02-28           rent  24586.72      unknown
51  2024-03-02           rent  74398.04      unknown
66  2024-03-13         health  68285.52      unknown
87  2024-04-17  entertainment  55049.61      unknown
88  2024-04-17      utilities  62158.21      unknown
99  2024-04-27         health  56367.04      unknown
112 2024-05-11      groceries  27731.35      unknown
124 2024-05-27           fuel   8456.40      unknown
126 2024-05-28       shopping  42845.21      unknown
153 2024-07-12  subscriptions  15048.24      unknown
169 2024-07-27      transport  33040.06      unknown
184 2024-08-13      utilities  31332.57      unknown
215 2024-09-22         health  55519.01      unknown
220 2024-10-03           fuel  62543.80      unknown
229 2024-10-12      utilities  71169.93      unknown
263 2024-12-02      utilities  58519.79      unknown
273 2024-12-20      groceries  41351.44      unknown
277 2024-12-23      transport  62679.15      unknown
288 2025-01-03      utilities  77984.80      unknown
297 2025-01-12  entertainment  30238.36      unknown
300 2025-01-15      transport   7222.93      unknown
305 2025-01-21       shopping  24054.46      unknown
308 2025-01-23       shopping  32781.55      unknown
344 2025-03-08  entertainment  12526.72      unknown
355 2025-03-18         health  26837.25      unknown), ('upi',           Date       Category    Amount Payment_Mode
1   2024-01-03           rent  44615.69          upi
3   2024-01-05  entertainment  26641.36          upi
4   2024-01-06      utilities  31115.46          upi
7   2024-01-13         dining  32881.53          upi
8   2024-01-13         health  56008.95          upi
..         ...            ...       ...          ...
350 2025-03-15  subscriptions   4094.35          upi
353 2025-03-17      utilities   2216.97          upi
356 2025-03-18       shopping  51713.64          upi
358 2025-03-21       shopping  47816.96          upi
360 2025-03-24      transport  33402.19          upi

[148 rows x 4 columns])]

In [50]:
df["Payment_Mode"].value_counts()

Payment_Mode
upi              148
cash              69
bank transfer     50
debit card        35
credit card       33
unknown           28
Name: count, dtype: int64